
move 2 to nroutes.


move "showsum/%value1/%value2" to routing-pattern(1).
move "showsum" to routing-destiny(1).


move "other_app" to routing-pattern(2).
move "other_app" to routing-destiny(2).

